In [15]:
# List of high schools
high_school = ["Huang High School", "Figueroa High School", "Shelton High School", "Hernandez High Schoool", "Griffin High School", "Wilson High School","Cabrera High School", "Bailey High School", "Holden High School","Pena Hihg School", "Wright High School", "Rodriguez High School", "Johnson High School", "Frod High School", "Thomas High School" ]

In [6]:
import pandas as pd

goog_df = pd.DataFrame({"AAPL": [1045.85, 1070.08, 1140.99, 1113.65, 1193.32, 1231.54, 1215.00, 1207.15,1248.84, 1166.27, 1138.85, 1003.63, 1080.91]})

goog_df.mean()

AAPL    1142.775385
dtype: float64

In [16]:
# Add the Pandas dependency
import pandas as pd

In [17]:
# Create a Pandas Series from  list

school_series = pd.Series(high_school)

school_series

0          Huang High School
1       Figueroa High School
2        Shelton High School
3     Hernandez High Schoool
4        Griffin High School
5         Wilson High School
6        Cabrera High School
7         Bailey High School
8         Holden High School
9           Pena Hihg School
10        Wright High School
11     Rodriguez High School
12       Johnson High School
13          Frod High School
14        Thomas High School
dtype: object

In [23]:
print(school_series[2])

Shelton High School

In [46]:
# A dictionary of high schools
high_school_dicts = [{"School ID": 0, "school_name": "Huang High School", "type": "District"},
                    {"School ID": 1, "school_name": "Figueroa High School", "type": "District"},
                    {"School ID": 2, "school_name":"Shelton High School", "type": "Charter"},
                    {"School ID": 3, "school_name":"Hernandez High School", "type": "District"},
                    {"School ID": 4, "school_name":"Griffin High School", "type": "Charter"}]

In [26]:
school_df = pd.DataFrame(high_school_dicts)
school_df

   School ID            school_name      type
0          0      Huang High School  District
1          1   Figueroa High School  District
2          2    Shelton High School   Charter
3          3  Hernandez High School  District
4          4    Griffin High School   Charter

In [50]:
# Three separate lists of information on high schools
school_id = [0, 1, 2, 3, 4]

school_name = ["Huang High School", "Figueroa High School",
"Shelton High School", "Hernandez High School","Griffin High School"]

type_of_school = ["District", "District", "Charter", "District","Charter"]

In [36]:
# Initialize a new DataFrame.
schools_df = pd.DataFrame()

In [37]:
# Add the list to a new DataFrame.

schools_df["School ID"] = school_id

schools_df["School Name"] = school_name

schools_df["type_of_school"] = type_of_school

# Print the DataFrame.
schools_df

   School ID            School Name type_of_school
0          0      Huang High School       District
1          1   Figueroa High School       District
2          2    Shelton High School        Charter
3          3  Hernandez High School       District
4          4    Griffin High School        Charter

In [51]:
# Create a dictionary of information on high schools.
high_schools_dict = {'School ID': school_id, 'school_name':school_name, 'type':type_of_school}

In [52]:
# Creating the high_school__dict to a data frame
hs_dict_df =pd.DataFrame()

In [53]:
hs_dict_df['HS Dictionary'] = high_schools_dict
hs_dict_df

            HS Dictionary
School ID       School ID
school_name   school_name
type                 type

In [54]:
school_df.columns

Index(['School ID', 'school_name', 'type'], dtype='object')

In [55]:
school_df.index

RangeIndex(start=0, stop=5, step=1)

In [56]:
school_df.values

array([[0, 'Huang High School', 'District'],
       [1, 'Figueroa High School', 'District'],
       [2, 'Shelton High School', 'Charter'],
       [3, 'Hernandez High School', 'District'],
       [4, 'Griffin High School', 'Charter']], dtype=object)

In [2]:
import pandas as pd

prices = pd.DataFrame({
    "price_usd":["$0.53", "$0.22", "0.34"]
    
})

prices.dtypes

price_usd    object
dtype: object

In [9]:
sales_df = pd.DataFrame({"item": ["tomatoes", "onions", "potatoes", "tomatoes", "mushrooms"],
                "quantity": [15, 26, 10, 12, 2],
                "total_price": [50.25, 39.52, 50.01, 40.20, 8.46]})
sales_df.max()

item           tomatoes
quantity             26
total_price       50.25
dtype: object

In [11]:
# Create a DataFrame
aapl_returns = pd.DataFrame({"AAPL": [0.5, 0.56, 0.59, 0.52, 0.1]})

# Select the first row using iloc
aapl_returns.iloc[0:3]

   AAPL
0  0.50
1  0.56
2  0.59